---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveWallOffsetRoofs
source: html/f7a48cf2-f8d2-d28c-dd5f-392b420f2463.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveWallOffsetRoofs Property

"Overhang"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveWallOffsetRoofs { get; }
```